app/views/users/show.html.erb

      <% current, past = [], [] %>
      <% for h in History.where(user_email: @user.email) %>
---
SELECT  "histories".* FROM "histories" WHERE "histories"."user_email" = ? LIMIT ?  [["user_email", "xli47@ncsu.edu"], ["LIMIT", 1]]