app/views/histories/search.html.erb

SELECT "rooms".* FROM "rooms" WHERE ( room_id not in (SELECT DISTINCT rooms.room_id FROM "rooms" LEFT OUTER JOIN histories on rooms.room_id = histories.room_id WHERE ((('2016-10-05 16:00:00' >= histories.startTime AND '2016-10-05 16:00:00' < histories.endTime ) OR ( '2016-10-05 18:00:00' > histories.startTime AND '2016-10-05 18:00:00' <= histories.endTime )))))
SELECT COUNT(*) FROM "rooms" WHERE ( room_number not in (SELECT DISTINCT rooms.room_id FROM "rooms" LEFT OUTER JOIN histories on rooms.id = histories.room_id WHERE ((('2016-10-05 14:00:00' >= histories.start_time AND '2016-10-05 14:00:00' < histories.end_time ) OR ( '2016-10-05 14:00:00' > histories.start_time AND '2016-10-05 14:00:00' <= histories.end_time )))))
---
        <td><%= room.building %></td>
        <td><%= link_to 'Book',new_history_path(:room => room.room_id, :start_time => @search_start_time, :end_time => @search_end_time, :size => room.size, :building => room.building) %></td>