app/controllers/histories_controller.rb

SELECT  "histories".* FROM "histories" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "histories"
---
  def index
    @histories = History.paginate(page: params[:page])

SELECT  "histories".* FROM "histories" WHERE "histories"."room_id" = ? LIMIT ?  [["room_id", "xiaobei's room"], ["LIMIT", 1]]
SELECT  1 AS one FROM "histories" WHERE LOWER("histories"."room_id") = LOWER(?) LIMIT ?  [["room_id", "e2001"], ["LIMIT", 1]]
SELECT  1 AS one FROM "rooms" WHERE "rooms"."room_id" = ? LIMIT ?  [["room_id", "111"], ["LIMIT", 1]]
SELECT  1 AS one FROM "histories" WHERE LOWER("histories"."user_email") = LOWER(?) LIMIT ?  [["user_email", "xli47@ncsu.edu"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "555@email.cod"], ["LIMIT", 1]]
SELECT "histories".* FROM "histories" WHERE "histories"."user_email" = ?  [["user_email", "xbm@qq.com"]]
---
  def create
    @history = History.new(history_params)    # not finised
    @history.startTime = @history.startTime.to_time + 0.minutes
    @history.endTime = @history.endTime.to_time + 0.minutes
    # need some constraints here. only one booking per day.... , if xbm@qq.com is in user list

    if !Room.exists?(room_id: @history.room_id)
      flash[:danger] = "Room not exists"
      render 'new' and return
    end
    if !User.exists?(email: @history.user_email)

INSERT INTO "histories" ("room_id", "created_at", "updated_at", "user_email") VALUES (?, ?, ?, ?)  [["room_id", "e2001"], ["created_at", 2016-09-24 07:00:28 UTC], ["updated_at", 2016-09-24 07:00:28 UTC], ["user_email", "xli47@ncsu.edu"]]
---
      end
    end

    if @history.save

SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
     @history = History.find(params[:id])

DELETE FROM "histories" WHERE "histories"."id" = ?  [["id", 1]]
SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    History.find(params[:id]).destroy

SELECT "histories".* FROM "histories"
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."room_id" = ? LIMIT ?  [["room_id", "A101"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "rooms" WHERE ( room_id not in (48,48))
---
  def search
    @rooms = []
    if params.has_key?(:start_time)
      @size = params[:size]
      @building = params[:building]
      @search_start_time = DateTime.new(params[:start_time]['year'].to_i ,params[:start_time]['month'].to_i ,params[:start_time]['day'].to_i ,params[:start_time]['hour'].to_i ,00,00)
      @search_end_time = @search_start_time + 2.hours
      if @search_end_time <= Time.now - 3.hours
        flash[:danger] = "time selected has past, select a new time"
      end
=begin
      if @search_start_time > Time.now+7.days
        flash[:danger] = "booking up to 7 days ahead"
      end
=end
=begin
      subquery = Room.joins("LEFT OUTER JOIN histories on rooms.room_id = histories.room_id").where("((? >= histories.startTime AND ? < histories.endTime ) OR ( ? > histories.startTime AND ? <= histories.endTime ))", @search_start_time, @search_start_time, @search_end_time, @search_end_time).distinct.select('rooms.room_id')
=end
      subquery = []
      History.all.each do |h|
        if h.startTime<=@search_start_time and h.endTime>@search_start_time
          subquery.push(h.room_id)
        end
        if h.startTime<@search_end_time and h.endTime>=@search_end_time
          subquery.push(h.room_id)
        end
      end
      if subquery==[]
        @rooms = Room.all
      elsif @size != 'Any' and @building != 'Any'
        @rooms = Room.where(" room_id not in (?)", subquery).where(" size = ?", @size).where(" building = ?", @building)

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "histories".* FROM "histories" WHERE "histories"."room_id" = ? ORDER BY "histories"."startTime" ASC  [["room_id", "A101"]]
---
  def roomhistory
    @room = Room.find(params[:id])
    @histories = History.where(room_id: @room.room_id).order(:startTime)