app/controllers/rooms_controller.rb

SELECT  "rooms".* FROM "rooms" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "rooms"
---
  def index
    @rooms = Room.paginate(page: params[:page])

INSERT INTO "rooms" ("room_id", "size", "created_at", "updated_at", "building") VALUES (?, ?, ?, ?, ?)  [["room_id", "e1001"], ["size", "Small"], ["created_at", 2016-09-29 19:07:04 UTC], ["updated_at", 2016-09-29 19:07:04 UTC], ["building", "D.H.hill"]]
---
  def create
    @room = Room.new(room_params)    # not finised
    if @room.save

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "histories".* FROM "histories" WHERE "histories"."room_id" = ?  [["room_id", "A102"]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 1]]
---
  def destroy
    @room = Room.find(params[:id])
    his = History.where(room_id: @room.room_id)
      flag = false
      for i in his
        if i.endTime>=Time.now-3.hours
          flag = true
          break
        end
      end
      if flag
        flash[:danger] = "This room has pending reservations, please cancel the booking before delete the room"
        redirect_to rooms_url and return
      end
    @room.destroy

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @room = Room.find(params[:id])

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."room_id" = 'banji' LIMIT ?  [["LIMIT", 1]]
SELECT "histories".* FROM "histories" WHERE "histories"."room_id" = ?  [["room_id", "xiaobei's room"]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "histories" ("room_id", "created_at", "updated_at", "user_email", "startTime", "endTime") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "rooms" SET "status" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["status", true], ["updated_at", 2016-09-22 19:22:05 UTC], ["id", 3]]
---
  def update
    @room = Room.find_by(room_id: params[:rid])
    @history = History.new
    @history.user_email = current_user.email
    @history.room_id = params[:rid]
    @history.startTime = params[:start_time][0].to_time
    @history.endTime = params[:start_time][0].to_time + 2.hours
    if @history.startTime > Time.now+7.days
      flash[:danger] = "booking up to 7 days ahead"
      redirect_to @room and return
    end

    @hists = History.where(room_id: @history.room_id)
    @hists.each do |h|
        if h.startTime<@history.startTime and h.endTime>@history.startTime
          flash[:danger] = "Conflict"
          redirect_to @room and return
        end
        if h.startTime>@history.startTime and h.startTime<@history.endTime
          flash[:danger] = "Conflict"
          redirect_to @room and return
        end
    end

    if @history.save