app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."admin" = ? LIMIT ? OFFSET ?  [["admin", true], ["LIMIT", 30], ["OFFSET", 0]]
---
  def adminlist
    list=User.where(:admin => true)
    @users=list.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."admin" = ? LIMIT ? OFFSET ?  [["admin", true], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."admin" = ?  [["admin", true]]
---
  def index
    if current_user.admin?
       list=User.where(:admin => false)
       @users=list.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "admin") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "histories".* FROM "histories" WHERE "histories"."user_email" = ?  [["user_email", "example-2@railstutorial.org"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 14]]
---
  def destroy
      @user = User.find(params[:id])
      his = History.where(user_email: @user.email)
      flag = false
      for i in his
        if i.endTime>=Time.now-3.hours
          flag = true
          break
        end
      end
      if flag
        flash[:danger] = "This user has pending reservations, please cancel the booking before delete the user"
        redirect_to users_url and return
      end
      @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", false], ["updated_at", 2016-09-23 07:02:59 UTC], ["id", 10]]
---
  def downgrade
    @user = User.find(params[:id])
    @user.admin = false
    @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", true], ["updated_at", 2016-09-23 07:02:54 UTC], ["id", 10]]
---
  def upgrade
    @user = User.find(params[:id])
    @user.admin = true
    @user.save